/*******************************************************************************
* タイトル:		Battleヘッダー
* プログラム名:	battle.h
* 作成者:		GP11A132 99 外岡高明
* 作成日:		2021/04/26
*******************************************************************************/

#pragma once	// インクルードガード（多重インクルード防止）

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "player.h"
#include "enemy.h"


/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/
struct BATTLE
{
	char name[256];		// 名前
	int damage;

	// バトル用メンバー変数
	int hp, hp_max;		// HP / HP Max
	int atk, atk_max;	// 攻撃力

	PLAYER* player;		// バトルの結果をMAPへ反映させるため
	ENEMY* enemy;		// バトルの結果をMAPへ反映させるため
};


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitBattle(void);
void UninitBattle(void);
void UpdateBattle(void);
void DrawBattle(void);

// バトル番号を引数に貰ってそれを元にバトルの初期化を行う
void SetBattle(int no);

// バトルの勝ち負けを取得する
int GetBattleResult(void);


