/*******************************************************************************
* タイトル:		メインヘッダー
* プログラム名:	main.h
* 作成者:		GP11A132 99 外岡高明
* 作成日:		2021/04/26
*******************************************************************************/

#pragma once	// インクルードガード（多重インクルード防止）

/*******************************************************************************
* scanf のwarning防止
*******************************************************************************/
#define _CRT_SECURE_NO_WARNINGS


/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include <stdio.h>
#include <conio.h>
#include <Windows.h>
#include <time.h>


/*******************************************************************************
* マクロ定義
*******************************************************************************/
enum 
{
		GAME_TITLE,
		GAME_FIELD,
		GAME_BATITLE,

};

/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
// Main OBJ
void Init(void);
void Uninit(void);
void Update(void);
void Draw(void);

// モードの取得関数
int GetMode(void);

// モードをセットする関数
void SetMode(int no);




//0= ゲームタイトル　１．ゲームフィールド　２．バトル　にかえておく
//単語選択して右クリックして「すべての参照を検索」で検索。
//選択してタブキーとシフトキーを押しながらやると行を動かせる（整える）
//折るとキーを押しながらクリックしてドラッグすると任意の範囲が選択出来る。
//エンディング画面も追加する。
//水曜日から開始！！

//★覚えておく
//※三項演算子

int aaa = 100;
int bbb;

if (aaa == 0)
{
	bbb = 1;
}
else
{
	bbb = 0;
}

// ３校演算子を使った例
//			条件	 ? 真  : 偽
bbb = (aaa == 0) ? 1 : 0;